import avatarReview from '../assets/images/avatar-review.jpg';
import bookImage1 from '../assets/images/book.jpg';
import bookImage2 from '../assets/images/book2.jpg';
import bookImage3 from '../assets/images/book3.jpg';
import bookImage4 from '../assets/images/book4.jpg';



export const booksList1 = [
    {
        bookName: 'Грокаем алгоритмы. Иллюстрированное пособие для програ...',
        evaluation: 4.3,
        author: 'Адитья Бхаргава',
        year: '2019',
        availability: 'available',
        date: '',
        image: [],
        id: 1,
        publishingHouse: 'Питер',
        pages: 234,
        binding: 'Мягкая обложка',
        size: '70х100',
        genre: 'computer',
        description: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        weight: 200,
        isbn: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        review: [{
            user: 'Иван Иванов',
            avatar: avatarReview,
            date: '14 июля 2007',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 3,
            id: 11
        },
        {
            user: 'Кирилл Иванов',
            avatar: avatarReview,
            date: '12 августа 2005',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 3,
            id: 12
        },
        {
            user: 'Алена Павлова',
            avatar: avatarReview,
            date: '01 января 2020',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 3,
            id: 13
        }]
    },
    {
        bookName: 'Грокаем алгоритмы. Иллюстрированное пособие для програ...',
        evaluation: 3,
        author: 'Адитья Бхаргава',
        year: '2019',
        availability: 'busy',
        date: '23.04',
        image: [{ id: 22, img: bookImage1 }],
        id: 2,
        publishingHouse: 'Питер',
        pages: 234,
        binding: 'Мягкая обложка',
        size: '70х100',
        genre: 'computer',
        description: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время. Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        weight: 100,
        isbn: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        review: [{
            user: 'Иван Иванов',
            avatar: avatarReview,
            date: '14 июля 2007',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 3,
            id: 21
        },
        {
            user: 'Кирилл Иванов',
            avatar: avatarReview,
            date: '12 августа 2005',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 3,
            id: 22
        },
        {
            user: 'Алена Павлова',
            avatar: avatarReview,
            date: '01 января 2020',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 3,
            id: 23
        }]
    },
    {
        bookName: 'Грокаем алгоритмы. Иллюстрированное пособие для програ...',
        evaluation: 5,
        author: 'Адитья Бхаргава',
        year: '2019',
        availability: 'available',
        date: '',
        image: [{ id: 32, img: bookImage1 }, { id: 33, img: bookImage2 }, { id: 34, img: bookImage3 }],
        id: 3,
        publishingHouse: 'Питер',
        pages: 234,
        binding: 'Мягкая обложка',
        size: '70х100',
        genre: 'computer',
        description: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время. Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        weight: 400,
        isbn: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        review: [{
            user: 'Иван Иванов',
            avatar: avatarReview,
            date: '14 июля 2007',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 2,
            id: 31
        },
        {
            user: 'Кирилл Иванов',
            avatar: avatarReview,
            date: '12 августа 2005',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 1,
            id: 32
        },
        {
            user: 'Алена Павлова',
            avatar: avatarReview,
            date: '01 января 2020',
            text: '',
            userEvaluation: 3,
            id: 33
        }]
    },
    {
        bookName: 'Грокаем алгоритмы. Иллюстрированное пособие для програ...',
        evaluation: null,
        author: 'Адитья Бхаргава',
        year: '2019',
        availability: 'available',
        date: '',
        image: [{ id: 42, img: bookImage2 }, { id: 43, img: bookImage3 }, { id: 44, img: bookImage4 }],
        id: 4,
        publishingHouse: 'Минск',
        pages: 234,
        binding: 'Мягкая обложка',
        size: '70х100',
        genre: 'computer',
        description: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время. Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        weight: 300,
        isbn: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        review: [{
            user: 'Иван Иванов',
            avatar: avatarReview,
            date: '14 июля 2007',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 4,
            id: 41,

        },
        {
            user: 'Кирилл Иванов',
            avatar: avatarReview,
            date: '12 августа 2005',
            text: 'Cool',
            userEvaluation: 5,
            id: 42
        },
        {
            user: 'Алена Павлова',
            avatar: avatarReview,
            date: '01 января 2020',
            text: 'Not bad',
            userEvaluation: 3,
            id: 43
        }]
    },
    {
        bookName: 'Грокаем алгоритмы. Иллюстрированное пособие для програ...',
        evaluation: 3,
        author: 'Адитья Бхаргава',
        year: '2019',
        availability: 'booked',
        date: '04.01',
        image: [],
        id: 5,
        publishingHouse: 'Москва',
        pages: 234,
        binding: 'Мягкая обложка',
        size: '70х100',
        genre: 'computer',
        description: 'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время. Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
        weight: 200,
        isbn: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198206, г. Санкт-Петербург, Петергофское ш, д. 73, лит. А29',
        review: [{
            user: 'Кирилл Иванов',
            avatar: avatarReview,
            date: '12 августа 2005',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 2,
            id: 51
        },
        {
            user: 'Кирилл Иванов',
            avatar: avatarReview,
            date: '12 августа 2005',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 1,
            id: 52
        },
        {
            user: 'Алена Павлова',
            avatar: avatarReview,
            date: '01 января 2020',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: '',
            id: 53
        }]
    },
    {
        bookName: 'Грокаем алгоритмы. Иллюстрированное пособие для програ...',
        evaluation: 2,
        author: 'Адитья Бхаргава',
        year: '2019',
        availability: 'available',
        date: '',
        image: [{ id: 62, img: bookImage1 }, { id: 63, img: bookImage2 }, { id: 64, img: bookImage3 }],
        id: 6,
        publishingHouse: 'Казань',
        pages: 234,
        binding: 'Мягкая обложка',
        size: '70х100',
        genre: 'computer',
        weight: 200,
        isbn: '978-5-4461-0923-4',
        manufacturer: 'ООО «Питер Мейл». РФ, 198206, г.Санкт-Петербург, Петергофское ш, д.73, лит. А29',
        review: [{
            user: 'Кирилл Иванов',
            avatar: avatarReview,
            date: '12 августа 2005',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 1,
            id: 61
        },
        {
            user: 'Кирилл Иванов',
            avatar: avatarReview,
            date: '12 августа 2005',
            text: 'Хорошо',
            userEvaluation: 4,
            id: 62
        },
        {
            user: 'Алена Павлова',
            avatar: avatarReview,
            date: '01 января 2020',
            text: 'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
            userEvaluation: 2,
            id: 63
        }]
    }
];